[
  {
    "name": "Dylan Barnes",
    "comment": "Great product! Keeps my water cold even during long hikes. Cheers from Germany!"
  },
  {
    "name": "Lukas Sliazas",
    "comment": "Literally saved my life. It's not just a bottle. It's an experience."
  },
  {
    "name": "Dominik Slifko",
    "comment": "Finally a bottle with USB-C! Makes charging the lid so convenient."
  },
  {
    "name": "Sophia Müller",
    "comment": "The insulation works amazingly well. My tea stays warm all day during winter."
  },
  {
    "name": "Emily Johnson",
    "comment": "Stylish and practical! I get compliments on the lavender color all the time."
  },
  {
    "name": "Michael Brown",
    "comment": "Honestly, I think it’s overpriced for what it is. Doesn’t keep my drinks cold as long as advertised."
  },
  {
    "name": "Olivia White",
    "comment": "Solid build quality, but it's way too heavy to carry around every day. Disappointed."
  },
  {
    "name": "James Anderson",
    "comment": "I was skeptical, but it really keeps my coffee hot for hours. Worth every penny!"
  },
  {
    "name": "Isabella Garcia",
    "comment": "Not impressed. The cap started leaking after a week. Wouldn’t recommend."
  },
  {
    "name": "David Smith",
    "comment": "Perfect for the gym! The 1000 ml size is just right for a tough workout."
  },
  {
    "name": "Emma Wilson",
    "comment": "Really disappointed. The color started to fade after a few washes."
  },
  {
    "name": "Max Weber",
    "comment": "I take it everywhere. It’s sturdy and keeps my water cold during long flights."
  },
  {
    "name": "Laura Chen",
    "comment": "Bought it for the design, but it's also very practical. Love it!"
  },
  {
    "name": "Alexander Martin",
    "comment": "Not worth the hype. It’s just an ordinary bottle with an expensive price tag."
  },
  {
    "name": "Sophia Lee",
    "comment": "The bottle is amazing, but the lid can be hard to open when it’s too cold."
  },
  {
    "name": "Jack Thompson",
    "comment": "The insulation feature doesn’t work as expected. My coffee was lukewarm after an hour."
  },
  {
    "name": "Sarah Becker",
    "comment": "This bottle has become my daily companion. Durable and beautiful!"
  },
  {
    "name": "Maya Patel",
    "comment": "It’s okay, but I wish it were lighter. A bit bulky for commuting."
  },
  {
    "name": "Liam Fischer",
    "comment": "The stainless steel build is high quality, and it looks great too."
  },
  {
    "name": "Emma Wright",
    "comment": "Regretting the purchase. It doesn't keep my drinks cold as long as promised."
  }
]